Ran Plan for project: `Venus-legacy-production` dir: `legacy-production/Venus` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_iam_role.venus_build_termination_role will be created
+ resource "aws_iam_role" "venus_build_termination_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRoleWithWebIdentity"
+                       Condition = {
+                           StringEquals = {
+                               "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
+                           StringLike   = {
+                               "token.actions.githubusercontent.com:sub" = "repo:plentiau/Venus:*"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           Federated = "arn:aws:iam::519527725796:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "venus-build-termination-github-actions-role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "Name"    = "venus-build-termination-github-actions-role"
+           "Purpose" = "GitHub Actions - Venus build termination workflow"
        }
+       tags_all              = {
+           "Name"         = "venus-build-termination-github-actions-role"
+           "Purpose"      = "GitHub Actions - Venus build termination workflow"
+           "account_name" = "legacy-production"
+           "managed_by"   = "terraform"
+           "path"         = "legacy-production/Venus"
+           "repo"         = "terraform-plenti-iam"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # aws_iam_role_policy.venus_build_termination_ec2 will be created
+ resource "aws_iam_role_policy" "venus_build_termination_ec2" {
+       id          = (known after apply)
+       name        = "venus-build-termination-ec2-policy"
+       name_prefix = (known after apply)
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "ec2:DescribeInstances",
+                           "ec2:DescribeTags",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = "DescribeEC2Instances"
                    },
+                   {
+                       Action    = [
+                           "ec2:TerminateInstances",
                        ]
+                       Condition = {
+                           StringEquals = {
+                               "ec2:ResourceTag/Application" = "Venus"
+                               "ec2:ResourceTag/Role"        = "WebServer"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "arn:aws:ec2:ap-southeast-2:519527725796:instance/*"
+                       Sid       = "TerminateVenusWebInstances"
                    },
+                   {
+                       Action   = [
+                           "elasticloadbalancing:DescribeTargetHealth",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = "DescribeTargetHealth"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role        = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ venus_build_termination_role_arn = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p Venus-legacy-production
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.security.public.plenti.cloud/lock?id=plentiau%252Fterraform-plenti-iam%252Flegacy-production%252FVenus%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p Venus-legacy-production
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```